# OrientByView Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..OrientByView Property
ParameterTypeId Class See Also
---
"Rotate With Text"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId OrientByView { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property OrientByView As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ OrientByView {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace